clackups/draftling/firmware/sdkconfig.defaults.seeed_reterminal_e1001
# CMakePresets.json board defaults: Seeed Studio reTerminal E1001
# Sets the hardware model and IDF target used by the "seeed_reterminal_e1001" preset.

CONFIG_IDF_TARGET="esp32s3"
CONFIG_DRAFTLING_MODEL_SEEED_RETERMINAL_E1001=y

# "SD card via USB" (F1 menu): expose the on-board MicroSD as a USB
# Mass Storage device over the ESP32-S3's native USB port. See
# components/usb_msc.
CONFIG_TINYUSB_MSC_ENABLED=y
